README.org
#+TITLE: My Emacs Config
#+AUTHOR: Lokesh Mohanty
#+PROPERTY: header-args:emacs-lisp :tangle init.el

CHEATSHEET: [[file:cheatsheet.pdf][./cheatsheet.pdf]]

* Introduction
The configuration files are ~early-init.el~ and ~init.el~ and ~README.org~ is the literate config from which they are generated by =org-babel-tangle=.

To use this config, clone this repository in your home directory as ~.emacs.d~.

#+begin_src shell
  cd && git clone https://github.com/lokesh1197/.emacs.d.git
#+end_src

or in your ~XDG_CONFIG_HOME~ as ~emacs~

#+begin_src shell
  cd ~/.config && git clone https://github.com/lokesh1197/.emacs.d.git emacs
#+end_src

* Early Init
References: [[https://emacs.stackexchange.com/a/106][customize-set-variable > setq]]

** Native Compilation

#+begin_src emacs-lisp :tangle early-init.el
  ;; Prefer loading newest compiled .el file
  (customize-set-variable 'load-prefer-newer noninteractive)

  (when (featurep 'native-compile)
    ;; silence compiler warnings
    (setq native-comp-async-report-warnings-errors nil)
    ;; asynchronous native compilation
    (setq native-comp-deferred-compilation t)
    ;; Set the right directory to store the native compilation cache
    ;; NOTE: the method for setting the eln-cache directory depends on the emacs version
    (when (fboundp 'startup-redirect-eln-cache)
      (if (version< emacs-version "29")
          (add-to-list 'native-comp-eln-load-path (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory)))
        (startup-redirect-eln-cache (convert-standard-filename (expand-file-name "var/eln-cache/" user-emacs-directory)))))
    (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory)))
#+end_src

** Settings

#+begin_src emacs-lisp :tangle early-init.el
    ;; Don't enable package.el at startup
    (setq package-enable-at-startup nil)

    ;; Make the initial buffer load faster by setting its mode to fundamental-mode
    (customize-set-variable 'initial-major-mode 'fundamental-mode)

    (setq-default
     inhibit-startup-screen t            ; Disable start-up screen
     inhibit-startup-message t           ; Disable startup message
     inhibit-startup-echo-area-message t ; Disable initial echo message
     initial-scratch-message nil         ; Empty the initial *scratch* buffer
     initial-buffer-choice nil)          ; Open *scratch* buffer at init, make it 't' for using nano-splash

    ;; Set some default frame parameters
    (add-to-list 'default-frame-alist '(tool-bar-lines . 0))   ; disable the toolbar
    (add-to-list 'default-frame-alist '(tooltip-lines . 0))    ; disable the toolbar
    (add-to-list 'default-frame-alist '(menu-bar-lines . 0))   ; disalbe the menu bar
    (add-to-list 'default-frame-alist '(vertical-scroll-bars)) ; disable scroll bars
    (add-to-list 'default-frame-alist '(alpha 90 . 90))				 ; transparency

    ;; Example of setting a frame parameter manually
    ;; (set-frame-parameter (selected-frame) 'alpha '(90 . 90))

  (setq
    gc-cons-threshold most-positive-fixnum                    ; Inhibit garbage collection during startup
    byte-compile-warnings '(cl-functions)                     ; hide cl package deprecation warning
    auto-mode-case-fold nil                                   ; Use case-sensitive `auto-mode-alist' for performance
    fast-but-imprecise-scrolling t                            ; More performant rapid scrolling over unfontified regions
    ffap-machine-p-known 'reject                              ; Don't ping things that look like domain names
    frame-inhibit-implied-resize t                            ; Inhibit frame resizing for performance
    idle-update-delay 1.0                                     ; slow down UI updates down
    inhibit-compacting-font-caches t                          ; Inhibit frame resizing for performance
    read-process-output-max (* 1024 1024)                     ; Increase how much is read from processes in a single chunk.
    redisplay-skip-fontification-on-input t                   ; Inhibits it for better scrolling performance.
    command-line-x-option-alist nil                           ; Remove irreleant command line options for faster startup
    select-active-regions 'only                               ; Emacs hangs when large selections contain mixed line endings.
    auto-save-list-file-prefix nil                            ; Disable auto-save
    create-lockfiles nil                                      ; Disable lockfiles
    make-backup-files nil                                     ; Disable backup files
    custom-file (concat user-emacs-directory "custom.el")     ; Place all "custom" code in a temporary file
    vc-follow-symlinks t)                                      ; Do not ask about symlink following
#+end_src

* Settings

#+begin_src emacs-lisp
  (context-menu-mode)											              ; show context menu on right click
  (column-number-mode)                                  ; display position on modeline
  (global-visual-line-mode t)                           ; wrap lines
  (global-auto-revert-mode)
  (setq blink-cursor-mode nil)
  (add-hook 'prog-mode-hook 'hs-minor-mode)             ; enable folding
  (add-hook 'TeX-mode-hook 'hs-minor-mode)              ; enable folding for latex mode
  (add-hook 'prog-mode-hook 'display-line-numbers-mode) ; enable line numbers for all programming modes
  (add-hook 'TeX-mode-hook  'display-line-numbers-mode) ; enable line numbers for latex mode
  (add-hook 'org-mode-hook  'display-line-numbers-mode) ; enable line numbers for org mode

  (setq-default savehist-mode t)                                       ; persist history over emacs restarts
  (setq-default tab-width 2
                ;; display-line-numbers-type 'relative
                use-short-answers t                     ; Replace yes/no prompts with y/n
                confirm-nonexistent-file-or-buffer nil) ; Ok to visit non existent files

  (setq visible-bell '1)                                ; use visible bell instead of beep
  (recentf-mode 1)                                      ; Allow storing of recent files list
  (setq recentf-max-menu-items 25)
  (setq recentf-max-saved-items 50)

  (undelete-frame-mode)										; allows recovering a deleted frame (emacs 29)
#+end_src

* Package manager
** Straight
References: [[https://github.com/radian-software/straight.el][straight]], [[https://github.com/jwiegley/use-package][use-package]]

#+begin_src emacs-lisp
  ;; get latest version
  (setq straight-repository-branch "develop")

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; install package using straight if not installled
  (setq straight-use-package-by-default 't)
  ;; integrate with use-package
  (straight-use-package 'use-package)
  ;; to change git protocol
  ;; (straight-vc-git-default-protocol 'ssh)
#+end_src

** Package.el

#+begin_src emacs-lisp
  ;; (require 'package)
  ;; (add-to-list 'package-archives
  ;; 	     '("melpa" . "https://melpa.org/packages/") t)

  ;; (package-refresh-contents)
  ;; M-x package-install RET use-package RET
#+end_src

* General (key-bindings helper)
References: [[https://github.com/noctuid/general.el#evil-command-properties][general evil command properties]]

Use =general-describe-keybindings= to view all keybindings defined using =general.=

#+begin_src emacs-lisp
  (use-package general
    :init
    (setq general-override-states '(insert
                                    emacs
                                    hybrid
                                    normal
                                    visual
                                    motion
                                    operator
                                    replace))
    :config
    (general-create-definer my/leader
      ;; :keymaps '(normal insert visual emacs override)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (general-create-definer my/ctrl-c
      :prefix "C-c"))

  (my/leader :states 'normal :kemaps 'override
    "."    '(find-file :which-key "find file")
    "SPC"  (general-simulate-key "M-x" :which-key "M-x") 
    "p"    (general-simulate-key "C-x p" :which-key "project"))

  (general-def :states 'normal
    "j"   'evil-next-visual-line
    "k"   'evil-previous-visual-line)
#+end_src

* Graphics
** Theme
References: [[https://github.com/doomemacs/themes][doom-themes]], [[https://github.com/doomemacs/themes/tree/screenshots][doom-theme-screenshots]], [[https://github.com/lokesh1197/nano-splash][nano-splash]]

#+begin_src emacs-lisp
  ;; required as during daemon initialization, there are no frames
  ;; (use-package modus-themes
  ;; 	:config
  ;; 	(load-theme 'modus-vivendi-tinted t))
  (use-package gruvbox-theme
    :config
    (load-theme 'gruvbox-dark-medium t))
#+end_src

** Terminal fixes (emacs -nw)
  
#+begin_src emacs-lisp
  (set-language-environment 'utf-8)
  (setq locale-coding-system 'utf-8)

  ;; set the default encoding system
  (prefer-coding-system 'utf-8)
  (setq default-file-name-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

  ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
#+end_src

** Icons
References: [[https://github.com/domtronn/all-the-icons.el][all-the-icons]], [[https://github.com/iyefrat/all-the-icons-completion][all-the-icons-completion]]

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))

  (use-package all-the-icons-completion
    :after all-the-icons
    :config (all-the-icons-completion-mode))

  ;; (use-package all-the-icons-dired
  ;;   :if (display-graphic-p)
  ;;   :hook (dired-mode . all-the-icons-dired-mode))

  ;; run the below command to install fonts
  ;; (all-the-icons-install-fonts)
#+end_src

** Font
=Preferred fonts=:
- Source Code Pro
- Iosevka Fixed SS07

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :family "Iosevka Fixed SS07" :height 135)
  (set-face-attribute 'font-lock-comment-face nil
                      :family "Iosevka Fixed SS07"
                      :height 135
                      :slant 'italic)

  ;; (set-face-attribute 'font-lock-keywod-face nil
  ;;                     :family "Source Code Pro"
  ;;                     :height 140
  ;;                     :slant 'italic)
#+end_src

* No littering
References: [[https://github.com/emacscollective/no-littering][no-littering]]

#+begin_src emacs-lisp
  (use-package no-littering)
#+end_src

* Text Edit/Jump
